driver-tests/bpelse/assign/AssignJbi/test/echoSubstringNumANumBInvoke/Output.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://sun.com/echo/"
                   xmlns="urn:echoAssignTNS"><SOAP-ENV:Header/><SOAP-ENV:Body><item><value>LessThan</value><num1>5</num1><num2>8</num2></item></SOAP-ENV:Body></SOAP-ENV:Envelope>